AutoCarSimulation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.2 -0.1 -1e-02)
    (0.3 -0.1 -1e-02)
    (0.3 0.1 -1e-02)
    (-0.2 0.1 -1e-02)
    (-0.2 -0.1 0.12)
    (0.3 -0.1 0.12)
    (0.3 0.1 0.12)
    (-0.2 0.1 0.12)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 40 26) simpleGrading (1 1 1)
);



boundary
(
    frontAndBack
    {
        type patch;
        faces
        (
            (3 7 6 2)
            (1 5 4 0)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (0 3 2 1)
        );
    }
    upperWall
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
