AutoCarSimulation/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (-20 0 0);

boundaryField
{
    frontAndBack
    {
        type            slip;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (-20 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           uniform (-20 0 0);
    }
    lowerWall
    {
        type            fixedValue;
        value           uniform (-20 0 0);
    }
    upperWall
    {
        type            slip;
    }
    altro
    {
        type            noSlip;
    }
    lato
    {
        type            noSlip;
    }
    tetto
    {
        type            noSlip;
    }
}


// ************************************************************************* //
