AutoCarSimulation/0.orig/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 1.78;

boundaryField
{
    frontAndBack
    {
        type            slip;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1.78;
        value           uniform 1.78;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1.78;
    }
    lowerWall
    {
        type            omegaWallFunction;
        value           uniform 1.78;
    }
    upperWall
    {
        type            slip;
    }
    altro
    {
        type            omegaWallFunction;
        value           uniform 1.78;
    }
    lato
    {
        type            omegaWallFunction;
        value           uniform 1.78;
    }
    tetto
    {
        type            omegaWallFunction;
        value           uniform 1.78;
    }
}


// ************************************************************************* //
