AutoCarSimulation/system/meshQualityDict.12
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      meshQualityDict.cfg;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

maxNonOrtho       60;

maxBoundarySkewness 20;

maxInternalSkewness 4;

maxConcave        80;

// Minimum cell pyramid volume; case dependent
minVol            1e-13;

minTetQuality    -1e30;

// if >0 : preserve single cells with all points on the surface if the
// resulting volume after snapping (by approximation) is larger than
// minVolCollapseRatio times old volume (i.e. not collapsed to flat cell).
//  If <0 : delete always.
//minVolCollapseRatio 0.5;

minArea          -1;

minTwist          0.02;

minDeterminant    0.001;

minFaceWeight     0.05;

minVolRatio       0.01;

minTriangleTwist -1;

nSmoothScale      4;

errorReduction    0.75;

relaxed
{
    maxNonOrtho       75;
}

minFaceWeight 0.02;
// ************************************************************************* //
